src/Catalogs/СтатусыОбработкиВЕТИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>СтатусыОбработкиВЕТИС</Name>
			<Comment>Статусы обработки ВетИС</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСтатуса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСтатусовОбработкиВЕТИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДальнейшееДействие</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДальнейшиеДействияВЕТИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/СтатусыОбработкиВЕТИС/Ext/ManagerModule.bsl
// Модуль менеджера справочника "Статусы обработки ВетИС"

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ


Функция ПолучитьСтатусОбработки(ИмяДокумента, ВидСтатуса) Экспорт
	
	Результат = Неопределено;
	
	Если ТипЗнч(ИмяДокумента) = Тип("Строка") Тогда
		ВидДокумента = ОбщегоНазначения.ИдентификаторОбъектаМетаданных("Документ."+ИмяДокумента);
	Иначе
		ВидДокумента = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ИмяДокумента);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	СтатусыОбработкиВЕТИС.Ссылка,
	|	СтатусыОбработкиВЕТИС.ДальнейшееДействие
	|ИЗ
	|	Справочник.СтатусыОбработкиВЕТИС КАК СтатусыОбработкиВЕТИС
	|ГДЕ
	|	СтатусыОбработкиВЕТИС.ВидДокумента = &ВидДокумента И 
	|	СтатусыОбработкиВЕТИС.ВидСтатуса = &ВидСтатуса
	|";
	Запрос.УстановитьПараметр("ВидДокумента", ВидДокумента);
	Запрос.УстановитьПараметр("ВидСтатуса",   ВидСтатуса);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Результат = Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьСтатусыОбработки(ИмяДокумента, ВидСтатуса) Экспорт
	
	Результат = Неопределено;
	
	Если ТипЗнч(ИмяДокумента) = Тип("Строка") Тогда
		ВидДокумента = ОбщегоНазначения.ИдентификаторОбъектаМетаданных("Документ."+ИмяДокумента);
	Иначе
		ВидДокумента = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ИмяДокумента);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	СтатусыОбработкиВЕТИС.Ссылка
	|ИЗ
	|	Справочник.СтатусыОбработкиВЕТИС КАК СтатусыОбработкиВЕТИС
	|ГДЕ
	|	СтатусыОбработкиВЕТИС.ВидДокумента = &ВидДокумента И 
	|	СтатусыОбработкиВЕТИС.ВидСтатуса В (&ВидСтатуса)
	|";
	Запрос.УстановитьПараметр("ВидДокумента", ВидДокумента);
	Запрос.УстановитьПараметр("ВидСтатуса",   ВидСтатуса);
	Результат = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьСтатусОбработкиПоУмолчанию(ИмяДокумента) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("СтатусОбработки",    Неопределено);
	Результат.Вставить("ВидСтатуса",         Неопределено);
	Результат.Вставить("ДальнейшееДействие", Неопределено);
	
	ВидДокумента = ОбщегоНазначения.ИдентификаторОбъектаМетаданных("Документ."+ИмяДокумента);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	СтатусыОбработкиВЕТИС.Ссылка КАК СтатусОбработки,
	|	СтатусыОбработкиВЕТИС.ВидСтатуса,
	|	СтатусыОбработкиВЕТИС.ДальнейшееДействие
	|ИЗ
	|	Справочник.СтатусыОбработкиВЕТИС КАК СтатусыОбработкиВЕТИС
	|ГДЕ
	|	СтатусыОбработкиВЕТИС.ВидДокумента = &ВидДокумента И 
	|	СтатусыОбработкиВЕТИС.ПоУмолчанию = ИСТИНА
	|";
	Запрос.УстановитьПараметр("ВидДокумента", ВидДокумента);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Процедура заполнения предопределенных элементов справочника
//
Процедура ВыполнитьНачальноеЗаполнение() Экспорт
	
	Макет = Справочники.СтатусыОбработкиВЕТИС.ПолучитьМакет("НастройкиПоУмолчанию");
	
	СтатусыОбработки = Макет.ПолучитьОбласть("НастройкиПоУмолчанию");
	Объект = Неопределено;
	Для НомерСтроки = 1 По СтатусыОбработки.ВысотаТаблицы Цикл
		
		ИмяДокумента = СокрЛП(СтатусыОбработки.Область(НомерСтроки, 1).Текст);
		ИмяСтатуса   = СокрЛП(СтатусыОбработки.Область(НомерСтроки, 2).Текст);
		Описание     = СокрЛП(СтатусыОбработки.Область(НомерСтроки, 3).Текст);
		ПоУмолчанию  = ВРег(СокрЛП(СтатусыОбработки.Область(НомерСтроки, 4).Текст)) = "ИСТИНА";
		ИмяДействия  = СокрЛП(СтатусыОбработки.Область(НомерСтроки, 5).Текст);
		
		ВидСтатуса         = Перечисления.ВидыСтатусовОбработкиВЕТИС[ИмяСтатуса];
		Если Не ПустаяСтрока(ИмяДействия) Тогда
			ДальнейшееДействие = Перечисления.ДальнейшиеДействияВЕТИС[ИмяДействия];
		КонецЕсли;
		
		СтатусОбработки = ПолучитьСтатусОбработки(ИмяДокумента, ВидСтатуса);
		Если СтатусОбработки = Неопределено Тогда
			СтатусОбработкиОбъект = Справочники.СтатусыОбработкиВЕТИС.СоздатьЭлемент();
		Иначе
			СтатусОбработкиОбъект = СтатусОбработки.ПолучитьОбъект();
		КонецЕсли;
		
		СтатусОбработкиОбъект.ВидДокумента       = ОбщегоНазначения.ИдентификаторОбъектаМетаданных("Документ."+ИмяДокумента);;
		СтатусОбработкиОбъект.ВидСтатуса         = ВидСтатуса;
		СтатусОбработкиОбъект.Описание           = СокрЛП(Описание);
		СтатусОбработкиОбъект.Наименование       = СокрЛП(ВидСтатуса);
		СтатусОбработкиОбъект.ПоУмолчанию        = ПоУмолчанию;
		СтатусОбработкиОбъект.ДальнейшееДействие = ДальнейшееДействие;
		СтатусОбработкиОбъект.Записать();
		
	КонецЦикла;
	
КонецПроцедуры // ВыполнитьНачальноеЗаполнение()


////////////////////////////////////////////////////////////////////////////////
// ПАРАМЕТРЫ ОБРАБОТКИ РЕКВИЗИТОВ ОБЪЕКТА

// Производит формирование параметров проверки заполнения реквизитов объекта на предмет обязательности.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//
// Возвращаемое значение:
//  Массив - Возвращаемый массив содержит строковые идентификаторы реквизитов.
//
Функция ПолучитьОбязательныеРеквизиты(Объект) Экспорт
	
	// Обязательные реквизиты документа
	ОбязательныеРеквизиты = Новый Массив();
	ОбязательныеРеквизиты.Добавить("Наименование");
	
	// Возвращаем сформированные параметры проверки
	Возврат ОбязательныеРеквизиты;
	
КонецФункции // ПолучитьОбязательныеРеквизиты()

// Производит формирование параметров проверки заполнения реквизитов объекта на предмет обязательности и уникальности.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//
// Возвращаемое значение:
//  Структура - Возвращаемая структура содержит строковые идентификаторы реквизитов и вариант проверки его заполнения
//  (1-Обязательный, 2-Уникальный, 3-Уникальный и обязательный). Для описания проверки табличных частей используется
//  вложенная структура.
//
Функция ПолучитьУникальныеРеквизиты(Объект) Экспорт
	
	// Структура уникальных реквизитов
	УникальныеРеквизиты = Новый Структура();
	
	// Возвращаем сформированные параметры проверки
	Возврат УникальныеРеквизиты;
	
КонецФункции // ПолучитьУникальныеРеквизиты()


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ФОРМИРОВАНИЯ ПЕЧАТНЫХ ФОРМ

// Процедура используется для указания доступного данному виду объектов перечня вариантов печати.
//
// Параметры:
//  КомандыПечати - ТаблицаЗначений - Каждая строка таблицы соответствует одному из вариантов печати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
КонецПроцедуры // ДобавитьКомандыПечати()

// Производит формирование структуры с доступностью и видимостью команд печати объекта.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//
Функция ПолучитьПараметрыКомандПечати(Объект) Экспорт
	
	// Команды печати могут быть недоступны и/или невидимы в зависимости от параметров объекта.
	ПараметрыКоманд = Новый Соответствие;
	
	// Возвращаем сформированные параметры доступности команд проверки
	Возврат ПараметрыКоманд;
	
КонецФункции // ПолучитьПараметрыКомандПечати()

// Обработчик события формирования печатной формы.
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
КонецПроцедуры // Печать()

#КонецЕсли
